app/controllers/posts_controller.rb

	def index #Action (instance method)
		@posts = Post.all
---
SELECT "posts".* FROM "posts"

	def show #Action (instance method)
		@post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]